Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/Business_Resources/consultaTransacciones/ConsultaTransaccionSwitch/consultaTransaccionSwitchPS.wsdl

<wsdl:definitions name="consultaTransaccionSwitchPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaTransaccionSwitchPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaTransaccionSwitchPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaTransaccionSwitchTypes">

  <wsdl:types>
    <xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
	</xsd:schema>
	<xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaTransaccionSwitchTypes" schemaLocation="consultaTransaccionSwitchTypes.xsd"/>
	</xsd:schema>
  </wsdl:types>
  
  	<wsdl:message name="consultaTransaccionSwitchRequest">
		<wsdl:part element="cons:consultaTransaccionSwitch" name="parameters"/>
		<wsdl:part name="AutenticacionRequestHeader" element="auth:AutenticacionRequestHeader"/>
	</wsdl:message>
	<wsdl:message name="consultaTransaccionSwitchResponse">
		<wsdl:part element="cons:consultaTransaccionSwitchResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>
		
	<wsdl:portType name="consultaTransaccionSwitchPS">
		<wsdl:operation name="consultaTransaccionSwitch" parameterOrder="parameters AutenticacionRequestHeader ResponseHeader">
			<wsdl:input message="fic:consultaTransaccionSwitchRequest"/>
			<wsdl:output message="fic:consultaTransaccionSwitchResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="consultaTransaccionSwitchPSSOAP" type="fic:consultaTransaccionSwitchPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaTransaccionSwitch">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaTransaccionSwitchPS/consultaTransaccionSwitch"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:consultaTransaccionSwitchRequest" part="AutenticacionRequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:consultaTransaccionSwitchResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
  
  <wsdl:service name="consultaTransaccionSwitchPS">
    <wsdl:port binding="fic:consultaTransaccionSwitchPSSOAP" name="consultaTransaccionSwitchPSSOAP">
      <soap:address location="http://mwinterbanca:8003/Middleware/OperationsAndExecution/CustomerDeposits/ConsultaTransaccionSwitch"/>
    </wsdl:port>
  </wsdl:service>
  
</wsdl:definitions>